УНФ_ТЕСТ/src/InformationRegisters/КонтактЦентрВходящее/КонтактЦентрВходящее.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактЦентрВходящее</name>
  <resources>
    <name>ЭтоОбсуждениеМессенджера</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОтКого</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ТипВнешнейСистемы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникВходящегоКонтактЦентр</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УНФ_ТЕСТ/src/Enums/ВходящееИсходящееСобытие/ВходящееИсходящееСобытие.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВходящееИсходящееСобытие</name>
  <enumValues>
    <name>Входящее</name>
  </enumValues>
  <enumValues>
    <name>Исходящее</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Enums/ТипыСобытий/ТипыСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСобытий</name>
  <enumValues>
    <name>ТелефонныйЗвонок</name>
  </enumValues>
  <enumValues>
    <name>ЛичнаяВстреча</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронноеПисьмо</name>
  </enumValues>
  <enumValues>
    <name>СообщениеSMS</name>
  </enumValues>
  <enumValues>
    <name>Запись</name>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ/src/Documents/ЗадачаСотрудника/ЗадачаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗадачаСотрудника</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Выполнена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DefinedType.ОснованиеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеСтроковаяСсылка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Результат</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <comment>Свойство</comment>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>Значение</comment>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Теги</name>
    <attributes>
      <name>Тег</name>
      <type>
        <types>CatalogRef.ТегиЗадач</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ/src/Catalogs/ЗаписиКалендаряСотрудника/ЗаписиКалендаряСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаписиКалендаряСотрудника</name>
  <attributes>
    <name>Завершено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>DefinedType.ИсточникЗаписейКалендаря</types>
    </type>
  </attributes>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>CatalogRef.КалендариСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>Начало</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСтрокиИсточника</name>
    <comment>Для связи со строкой табличной части источника</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Окончание</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйИсточника</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>РедактированиеЗапрещено</name>
    <comment>Запрет интерактивного редактирования записи в планировщике</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьETag</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьИдентификатор</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлюч</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/Catalogs/СостоянияСобытий/СостоянияСобытий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СостоянияСобытий</name>
  <predefined>
    <items>
      <name>Завершено</name>
      <description>Завершено</description>
    </items>
    <items>
      <name>Запланировано</name>
      <description>Запланировано</description>
    </items>
    <items>
      <name>Отменено</name>
      <description>Отменено</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Цвет</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

УНФ_ТЕСТ/src/CommonModules/КонтактЦентр/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ДобавитьВоВходящее(Источник, ОписаниеВходящего = Неопределено) Экспорт
	
	ИсточникДляЗаписи = РазыменоватьСсылкуЕслиНеобходимо(Источник);
	
	Если ТипЗнч(Источник) = Тип("ИдентификаторОбсужденияСистемыВзаимодействия") Тогда
		ДобавитьОбсуждениеВоВходящее(ИсточникДляЗаписи, ОписаниеВходящего);
	Иначе
		ДобавитьИсточникВоВходящее(ИсточникДляЗаписи, ОписаниеВходящего);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьИзВходящего(Источник, Ответственный = Неопределено) Экспорт
	
	ИсточникДляЗаписи = РазыменоватьСсылкуЕслиНеобходимо(Источник);
	
	Запись = РегистрыСведений.КонтактЦентрВходящее.СоздатьНаборЗаписей();
	Запись.Отбор.Источник.Установить(Источник);
	Если Ответственный <> Неопределено Тогда
		Запись.Отбор.Ответственный.Установить(Ответственный);
	КонецЕсли;
	
	Запись.Записать();
	
КонецПроцедуры

Функция ОписаниеВходящего() Экспорт
	
	ОписаниеВходящего = Новый Структура;
	ОписаниеВходящего.Вставить("Описание", "");
	ОписаниеВходящего.Вставить("ОтКого", "");
	ОписаниеВходящего.Вставить("ТипВнешнейСистемы", Неопределено);
	ОписаниеВходящего.Вставить("Ответственный", Новый Массив);
	Возврат ОписаниеВходящего;
	
КонецФункции

Функция ЕстьПодключенныеКаналыВходящего() Экспорт	
	Возврат ПодключенТелеграм() ИЛИ ПодключенВконтакте() ИЛИ ПодключенаТелефония() ИЛИ ПодключенаПочта() ИЛИ ПодключенКабинетКлиента() ИЛИ ПодключенСайт();
КонецФункции

Функция ПодключенаТелефония() Экспорт
	Возврат Константы.ИспользоватьМобильнуюТелефонию.Получить() 
		ИЛИ Константы.ИспользоватьОблачнуюТелефонию.Получить();
КонецФункции

Функция ПодключенаПочта() Экспорт
	Возврат РегистрыСведений.УчетныеЗаписиПользователя.ПочтовыеСлужбыПодключены();
КонецФункции

Функция ПодключенКабинетКлиента() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НастройкиПубликацииМЛК.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.НастройкиПубликацииМЛК КАК НастройкиПубликацииМЛК";
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();

КонецФункции

Функция ПодключенСайт() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ОбменУправлениеНебольшойФирмойСайт.Ссылка КАК Ссылка
	|ИЗ
	|	ПланОбмена.ОбменУправлениеНебольшойФирмойСайт КАК ОбменУправлениеНебольшойФирмойСайт
	|ГДЕ
	|	НЕ ОбменУправлениеНебольшойФирмойСайт.Ссылка <> ЗНАЧЕНИЕ(ПланОбмена.ОбменУправлениеНебольшойФирмойСайт.ПустаяСсылка)";
	
	Результат = Запрос.Выполнить();
	
	Возврат НЕ Результат.Пустой();
	
КонецФункции

Функция ПодключенТелеграм() Экспорт
	
	ТелеграмПодключен = Ложь;
	
	Попытка
		ТипыВнешнихСистем = ОбсужденияСлужебныйКлиентСервер.ТипыВнешнихСистем();
		Для Каждого Интеграции ИЗ Вычислить("СистемаВзаимодействия.ПолучитьИнтеграции()") Цикл
			Если Интеграции.ТипВнешнейСистемы <> ТипыВнешнихСистем.Телеграм Тогда
				Продолжить;
			КонецЕсли;
			
			ТелеграмПодключен = Интеграции.Использование;
			Прервать;
		КонецЦикла;	
	Исключение
	КонецПопытки;
	
	Возврат ТелеграмПодключен;
	
КонецФункции

Функция ПодключенВконтакте() Экспорт
	ВконтактеПодключен = Ложь;
	
	Попытка
		ТипыВнешнихСистем = ОбсужденияСлужебныйКлиентСервер.ТипыВнешнихСистем();
		Для Каждого Интеграции ИЗ Вычислить("СистемаВзаимодействия.ПолучитьИнтеграции()") Цикл
			Если Интеграции.ТипВнешнейСистемы <> ТипыВнешнихСистем.ВКонтакте Тогда
				Продолжить;
			КонецЕсли;
			
			ВконтактеПодключен = Интеграции.Использование;
			Прервать;
		КонецЦикла;	
	Исключение
	КонецПопытки;
	
	Возврат ВконтактеПодключен;
КонецФункции

Функция ОбработаноВсеВходящее(Ответственный) Экспорт
	
	Если Пользователи.ЭтоПолноправныйПользователь() Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтактЦентрВходящее.Источник КАК Источник
		|ИЗ
		|	РегистрСведений.КонтактЦентрВходящее КАК КонтактЦентрВходящее";
		Результат = Запрос.Выполнить();
		Возврат Результат.Пустой();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактЦентрВходящее.Источник КАК Источник
	|ИЗ
	|	РегистрСведений.КонтактЦентрВходящее КАК КонтактЦентрВходящее
	|ГДЕ
	|	(КонтактЦентрВходящее.Ответственный = &Ответственный
	|			ИЛИ КонтактЦентрВходящее.Ответственный ЕСТЬ NULL)";
	
	Запрос.УстановитьПараметр("Ответственный", Ответственный);
	Результат = Запрос.Выполнить();
	Возврат Результат.Пустой();
	
КонецФункции

Процедура КонтактЦентрПроверкаИсточникаВходящегоПередЗаписьюОбработчик(Источник) Экспорт
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	ПроверитьИзменениеОтветственногоИсточникПередЗаписью(Источник);
КонецПроцедуры

Процедура КонтактЦентрПроверкаИсточникаВходящегоПриЗаписиОбработчик(Источник) Экспорт
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	ПроверитьИзменениеОтветственногоИсточникПриЗаписи(Источник);
КонецПроцедуры

Процедура КонтактЦентрПроверкаОснованияЗадачиПослеЗаписиПриЗаписи(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
		
	ПроверитьНаличиеОснованияЗадачиВоВходящем(Источник);
КонецПроцедуры

Функция ТекстЗапросаДелаВРаботе(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
		
	Если НЕ ОтборПоЗавершенным Тогда
		ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
		ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	КонецЕсли;
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаПросрочены(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоПросроченнымЗадачам = "ВЫБОР
	|			КОГДА ЗадачаСотрудника.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ЗадачаСотрудника.ДатаОкончания < &ТекущаяДатаСеанса
	|						И ЗадачаСотрудника.ДатаОкончания <> НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ ЗадачаСотрудника.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И ЗадачаСотрудника.ДатаНачала < &ТекущаяДатаСеанса
	|					И ЗадачаСотрудника.ДатаНачала <> НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|		КОНЕЦ";
	
	ОтборПоПросроченнымЗаписям = "ВЫБОР
	|			КОГДА ЗаписиКалендаряСотрудника.Окончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА ЗаписиКалендаряСотрудника.Окончание < &ТекущаяДатаСеанса
	|						И ЗаписиКалендаряСотрудника.Окончание <> НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|			ИНАЧЕ ЗаписиКалендаряСотрудника.Начало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И ЗаписиКалендаряСотрудника.Начало < &ТекущаяДатаСеанса
	|					И ЗаписиКалендаряСотрудника.Начало <> НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|		КОНЕЦ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоПросроченнымЗаписям);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоПросроченнымЗадачам);
	
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаНаСегодня(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоЗадачамНаСегодня = "ВЫБОР
	|			КОГДА ЗадачаСотрудника.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) <= &ТекущаяДатаСеанса
	|						И &ТекущаяДатаСеанса <= КОНЕЦПЕРИОДА(ЗадачаСотрудника.ДатаОкончания,ДЕНЬ)
	|			ИНАЧЕ ЗадачаСотрудника.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|		КОНЕЦ";
	
	ОтборПоЗаписямНаСегодня = "ВЫБОР
	|			КОГДА ЗаписиКалендаряСотрудника.Окончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) <= &ТекущаяДатаСеанса
	|						И &ТекущаяДатаСеанса <= КОНЕЦПЕРИОДА(ЗаписиКалендаряСотрудника.Окончание,ДЕНЬ)
	|			ИНАЧЕ ЗаписиКалендаряСотрудника.Начало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) = НАЧАЛОПЕРИОДА(&ТекущаяДатаСеанса, ДЕНЬ)
	|		КОНЕЦ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоЗаписямНаСегодня);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоЗадачамНаСегодня);
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаНаНеделе(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоЗадачамНаСегодня = "НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) >= НачалоПериода(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 2),ДЕНЬ)
	|						И ЗадачаСотрудника.ДатаНачала <= КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)";
	
	ОтборПоЗаписямНаСегодня = "НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) >= НачалоПериода(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 2),ДЕНЬ)
	|						И ЗаписиКалендаряСотрудника.Начало <= КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоЗаписямНаСегодня);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоЗадачамНаСегодня);
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаНаЗавтра(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоЗадачамНаСегодня = "ВЫБОР
	|			КОГДА ЗадачаСотрудника.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) <= НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1), ДЕНЬ)
	|						И ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1) <= КОНЕЦПЕРИОДА(ЗадачаСотрудника.ДатаОкончания,ДЕНЬ)
	|			ИНАЧЕ ЗадачаСотрудника.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1), ДЕНЬ)
	|		КОНЕЦ";
	
	ОтборПоЗаписямНаСегодня = "ВЫБОР
	|			КОГДА ЗаписиКалендаряСотрудника.Окончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) <= ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1)
	|						И ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1) <= КОНЕЦПЕРИОДА(ЗаписиКалендаряСотрудника.Окончание,ДЕНЬ)
	|			ИНАЧЕ ЗаписиКалендаряСотрудника.Начало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) = НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ТекущаяДатаСеанса, ДЕНЬ, 1), ДЕНЬ)
	|		КОНЕЦ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоЗаписямНаСегодня);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоЗадачамНаСегодня);
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаБезСрока(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоЗадачамНаСегодня = "ЗадачаСотрудника.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			И ЗадачаСотрудника.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	ОтборПоЗаписямНаСегодня = "ЗаписиКалендаряСотрудника.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|			И ЗаписиКалендаряСотрудника.Начало = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоЗаписямНаСегодня);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоЗадачамНаСегодня);
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаНаПозже(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	ОтборПоЗадачамНаСегодня = "ВЫБОР
	|			КОГДА ЗадачаСотрудника.ДатаОкончания <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаОкончания,ДЕНЬ) > КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)
	|			ИНАЧЕ ЗадачаСотрудника.ДатаНачала <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗадачаСотрудника.ДатаНачала,ДЕНЬ) > КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)
	|		КОНЕЦ";
	
	ОтборПоЗаписямНаСегодня = "ВЫБОР
	|			КОГДА ЗаписиКалендаряСотрудника.Окончание <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|				ТОГДА НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Окончание,ДЕНЬ) > КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)
	|			ИНАЧЕ ЗаписиКалендаряСотрудника.Начало <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	|					И НАЧАЛОПЕРИОДА(ЗаписиКалендаряСотрудника.Начало,ДЕНЬ) > КОНЕЦПЕРИОДА(&ТекущаяДатаСеанса, НЕДЕЛЯ)
	|		КОНЕЦ";
	
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("НЕ ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("НЕ ЗадачаСотрудника.Выполнена");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");

	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить(ОтборПоЗаписямНаСегодня);
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить(ОтборПоЗадачамНаСегодня);
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

Функция ТекстЗапросаДелаЗавершены(ОтборПоЗавершенным = Истина, ВыбратьПервые = Ложь) Экспорт
	
	ТекстЗапроса = ТекстЗапросаВсеДелаКонтактЦентра();
	СхемаЗапроса = Новый СхемаЗапроса;
	СхемаЗапроса.УстановитьТекстЗапроса(ТекстЗапроса);
	
	ОператорОбъединенныхЗаписейКалендаря = СхемаЗапроса.ПакетЗапросов[0].Операторы[0];
	ОператорОбъединенныхЗаписейЗадач = СхемаЗапроса.ПакетЗапросов[0].Операторы[1];
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Календарь В (&ВыбранныеКалендари)");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Календарь В (&ВыбранныеКалендари)");
	
	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Источник В (&РазрешенныеИсточники)");

	ОператорОбъединенныхЗаписейКалендаря.Отбор.Добавить("ЗаписиКалендаряСотрудника.Завершено");
	ОператорОбъединенныхЗаписейЗадач.Отбор.Добавить("ЗадачаСотрудника.Выполнена");
	
	Если ВыбратьПервые Тогда
		ОператорОбъединенныхЗаписейКалендаря.КоличествоПолучаемыхЗаписей = 1;
		ОператорОбъединенныхЗаписейЗадач.КоличествоПолучаемыхЗаписей = 1;
	КонецЕсли;
		
	Возврат СхемаЗапроса.ПолучитьТекстЗапроса();
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// См. ТекущиеДелаПереопределяемый.ПриОпределенииОбработчиковТекущихДел.
//
// Параметры:
//  ТекущиеДела - см. ТекущиеДелаСлужебный.ТекущиеДела
//
Процедура ПриЗаполненииСпискаТекущихДел(ТекущиеДела) Экспорт
	
	Если Не ПравоДоступа("Редактирование", Метаданные.Документы.ЗадачаСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	Подсистема = Метаданные.Подсистемы.CRM.Подсистемы.КонтактЦентр;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаВсеДелаКонтактЦентра() 
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаписиКалендаряСотрудника.Источник КАК Ссылка,
	|	ЗаписиКалендаряСотрудника.Ссылка КАК ЗаписьКалендаря,
	|	ЗаписиКалендаряСотрудника.Завершено КАК Состояние,
	|	ЗаписиКалендаряСотрудника.Источник.Состояние КАК СостояниеИсточника,
	|	ВЫРАЗИТЬ(ЗаписиКалендаряСотрудника.Описание КАК СТРОКА(1000)) КАК Содержание,
	|	"""" КАК Основание,
	|	ЗаписиКалендаряСотрудника.ОтветственныйИсточника КАК Ответственный,
	|	ЗаписиКалендаряСотрудника.Наименование КАК Наименование,
	|	ЗаписиКалендаряСотрудника.Начало КАК Начало,
	|	ЗаписиКалендаряСотрудника.Окончание КАК Окончание,
	|	ЗаписиКалендаряСотрудника.Начало КАК ДатаСоздания,
	|	ЗаписиКалендаряСотрудника.Календарь КАК Календарь,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(15)) КАК Отступ,
	|	1 КАК ЗадачаПросрочена,
	|	0 КАК КартинкаКалендаря,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(50)) КАК ДатаОбъединенная,
	|	0 КАК Картинка
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	Справочник.ЗаписиКалендаряСотрудника КАК ЗаписиКалендаряСотрудника
	|ГДЕ
	|	ЗаписиКалендаряСотрудника.Источник <> НЕОПРЕДЕЛЕНО
	|	И НЕ ЗаписиКалендаряСотрудника.ПометкаУдаления
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗадачаСотрудника.Ссылка,
	|	ЗНАЧЕНИЕ(Справочник.ЗаписиКалендаряСотрудника.ПустаяСсылка),
	|	ЗадачаСотрудника.Выполнена,
	|	ВЫБОР
	|		КОГДА ЗадачаСотрудника.Выполнена
	|			ТОГДА ""Выполнена""
	|		ИНАЧЕ ""Запланирована""
	|	КОНЕЦ,
	|	"""",
	|	ЗадачаСотрудника.Основание,
	|	ЗадачаСотрудника.Ответственный,
	|	ВЫРАЗИТЬ(ЗадачаСотрудника.Описание КАК СТРОКА(1000)),
	|	ЗадачаСотрудника.ДатаНачала,
	|	ЗадачаСотрудника.ДатаОкончания,
	|	ЗадачаСотрудника.Дата,
	|	ЗадачаСотрудника.Календарь,
	|	"""",
	|	0,
	|	0,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(30)),
	|	0
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК ЗадачаСотрудника
	|ГДЕ
	|	ЗадачаСотрудника.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задачи.Ссылка КАК Ссылка,
	|	ВТ_Задачи.Состояние КАК Состояние,
	|	ВТ_Задачи.ЗаписьКалендаря КАК ЗаписьКалендаря,
	|	ВТ_Задачи.СостояниеИсточника КАК СостояниеИсточника,
	|	ВТ_Задачи.Содержание КАК Содержание,
	|	ВТ_Задачи.Основание КАК Основание,
	|	ВТ_Задачи.Ответственный КАК Ответственный,
	|	ВТ_Задачи.Наименование КАК Наименование,
	|	ВТ_Задачи.Начало КАК Начало,
	|	ВТ_Задачи.Окончание КАК Окончание,
	|	ВТ_Задачи.ДатаСоздания КАК ДатаСоздания,
	|	ВТ_Задачи.Календарь КАК Календарь,
	|	ВТ_Задачи.Отступ КАК Отступ,
	|	ВТ_Задачи.ЗадачаПросрочена КАК ЗадачаПросрочена,
	|	ВТ_Задачи.КартинкаКалендаря КАК КартинкаКалендаря,
	|	ВТ_Задачи.ДатаОбъединенная КАК ДатаОбъединенная,
	|	ВТ_Задачи.Картинка КАК Картинка,
	|	ВТ_Задачи.Ссылка.Теги.(
	|		Тег КАК Тег
	|	) КАК Теги
	|ИЗ
	|	ВТ_Задачи КАК ВТ_Задачи";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Процедура ПроверитьНаличиеОснованияЗадачиВоВходящем(Источник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактЦентрВходящее.Источник КАК Источник,
	|	КонтактЦентрВходящее.Ответственный КАК Ответственный,
	|	КонтактЦентрВходящее.ЭтоОбсуждениеМессенджера КАК ЭтоОбсуждениеМессенджера,
	|	КонтактЦентрВходящее.Описание КАК Описание,
	|	КонтактЦентрВходящее.ОтКого КАК ОтКого,
	|	КонтактЦентрВходящее.ТипВнешнейСистемы КАК ТипВнешнейСистемы
	|ИЗ
	|	РегистрСведений.КонтактЦентрВходящее КАК КонтактЦентрВходящее
	|ГДЕ
	|	КонтактЦентрВходящее.Источник = &Источник
	|	И КонтактЦентрВходящее.Ответственный = &Ответственный";
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗадачаСотрудника") Тогда
		Если НЕ ЗначениеЗаполнено(Источник.Основание)Тогда
			Основание = Источник.ОснованиеСтроковаяСсылка;
		Иначе
			Основание = Источник.Основание;
		КонецЕсли;
	Иначе
		Основание = Источник.ДокументОснование;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Основание) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Источник", Основание);
	Запрос.УстановитьПараметр("Ответственный", Источник.Ответственный);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		КонтактЦентр.УдалитьИзВходящего(Основание);
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Функция РазыменоватьСсылкуЕслиНеобходимо(Ссылка)
	
	Если ТипЗнч(Ссылка) = Тип("ИдентификаторОбсужденияСистемыВзаимодействия") Тогда
		Возврат Строка(Ссылка);
	Иначе
		Возврат Ссылка;
	КонецЕсли;
	
КонецФункции

Функция ПараметрыЗаписиВходящего()
	
	ПараметрыЗаписиВходяшего = Новый Структура;
	ПараметрыЗаписиВходяшего.Вставить("Источник");
	ПараметрыЗаписиВходяшего.Вставить("Ответственный");
	ПараметрыЗаписиВходяшего.Вставить("ЭтоОбсуждениеМессенджера", Ложь);
	ПараметрыЗаписиВходяшего.Вставить("Описание", "");
	ПараметрыЗаписиВходяшего.Вставить("ОтКого", "");
	ПараметрыЗаписиВходяшего.Вставить("ТипВнешнейСистемы", "");
	Возврат ПараметрыЗаписиВходяшего;
	
КонецФункции

Процедура ДобавитьЗаписьВоВходящее(ПараметрыЗаписиВходящего)
	
	Если ПараметрыЗаписиВходящего.Свойство("Источник") 
		И НЕ ЗначениеЗаполнено(ПараметрыЗаписиВходящего.Источник) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Запись = РегистрыСведений.КонтактЦентрВходящее.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписиВходящего);
	Запись.Записать(Истина);
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ДобавитьОбсуждениеВоВходящее(ОбсуждениеИдентификатор, ОписаниеВходящего)
	
	Если ТипЗнч(ОписаниеВходящего.Ответственный) <> Тип("Массив") Тогда
		Ответственные = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеВходящего.Ответственный);
	Иначе
		Ответственные = ОписаниеВходящего.Ответственный;
	КонецЕсли;
	
	Для каждого Ответственный Из Ответственные Цикл
		ПараметрыЗаписиВходящего = ПараметрыЗаписиВходящего();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписиВходящего, ОписаниеВходящего);
		ПараметрыЗаписиВходящего.Ответственный = Ответственный;
		ПараметрыЗаписиВходящего.Источник = ОбсуждениеИдентификатор;
		ПараметрыЗаписиВходящего.ЭтоОбсуждениеМессенджера = Истина;
		ПараметрыЗаписиВходящего.ТипВнешнейСистемы = ОписаниеВходящего.ТипВнешнейСистемы;
		ДобавитьЗаписьВоВходящее(ПараметрыЗаписиВходящего);
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьИсточникВоВходящее(Источник, ОписаниеВходящего)
	
	Если ТипЗнч(ОписаниеВходящего.Ответственный) <> Тип("Массив") Тогда
		Ответственные = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОписаниеВходящего.Ответственный);
	Иначе
		Ответственные = ОписаниеВходящего.Ответственный;
	КонецЕсли;
	
	Для каждого Ответственный Из Ответственные Цикл
		ПараметрыЗаписиВходящего = ПараметрыЗаписиВходящего();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписиВходящего, ОписаниеВходящего);
		ПараметрыЗаписиВходящего.Источник = Источник;
		ПараметрыЗаписиВходящего.Ответственный = Ответственный;
		ДобавитьЗаписьВоВходящее(ПараметрыЗаписиВходящего);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИзменениеОтветственногоИсточникПередЗаписью(Источник)
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Событие") И Источник.ВходящееИсходящееСобытие = Перечисления.ВходящееИсходящееСобытие.Исходящее Тогда
		Возврат;
	КонецЕсли;
		
	ОтветственныйДо = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник.Ссылка, "Ответственный");
	Источник.ДополнительныеСвойства.Вставить("КонтактЦентр", Новый Структура());
	Источник.ДополнительныеСвойства.КонтактЦентр.Вставить("Ответственный", ОтветственныйДо);
	Источник.ДополнительныеСвойства.КонтактЦентр.Вставить("ЭтоНовый", Источник.ЭтоНовый());
	
КонецПроцедуры

Процедура ПроверитьИзменениеОтветственногоИсточникПриЗаписи(Источник)
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.Событие") И (Источник.ВходящееИсходящееСобытие = Перечисления.ВходящееИсходящееСобытие.Исходящее 
		ИЛИ Источник.ТипСобытия = Перечисления.ТипыСобытий.ЛичнаяВстреча ИЛИ Источник.ТипСобытия = Перечисления.ТипыСобытий.Запись 
		ИЛИ Источник.ТипСобытия = Перечисления.ТипыСобытий.Прочее) Тогда
		Возврат;
	КонецЕсли;
	
	ОтветственныйТекущий = Источник.Ответственный;
	ОтветственныйДо = Источник.ДополнительныеСвойства.КонтактЦентр.Ответственный;
	ЭтоНовый = Источник.ДополнительныеСвойства.КонтактЦентр.ЭтоНовый;
	
	Если ЭтоНовый Тогда
		Возврат;
	КонецЕсли;
	
	СотрудникТекущегоПользователя = УправлениеНебольшойФирмойПовтИсп.ПолучитьЗначениеПоУмолчаниюПользователя(Пользователи.ТекущийПользователь(), "ОсновнойОтветственный");
	Если ОтветственныйТекущий <> ОтветственныйДо И ОтветственныйТекущий <> СотрудникТекущегоПользователя Тогда
		ПриИзмененииОтветственногоВИсточнике(Источник.Ссылка, ОтветственныйДо, ОтветственныйТекущий, ЭтоНовый);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриИзмененииОтветственногоВИсточнике(Источник, ОтветственныйДо, ОтветственныйТекущий, ЭтоНовый);
	
	ПользовательСотрудника = РегистрыСведений.СотрудникиПользователя.ПолучитьПользователяПоСотруднику(ОтветственныйТекущий);
	
	Если НЕ Пользователи.РолиДоступны("ИспользованиеКонтактЦентра",ПользовательСотрудника) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьАктивныеЗадачиОтветственногоПоОснованию(Источник,ОтветственныйТекущий) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьАктивныеСобытияОтветственногоПоОснованию(Источник,ОтветственныйТекущий) Тогда
		Возврат;
	КонецЕсли;
	
	КонтактЦентр.УдалитьИзВходящего(Источник);
	
	ОписаниеВходящего = КонтактЦентр.ОписаниеВходящего();
	ОписаниеВходящего.Ответственный = ОтветственныйТекущий;
	КонтактЦентр.ДобавитьВоВходящее(Источник, ОписаниеВходящего);
	
КонецПроцедуры

Функция ЕстьАктивныеЗадачиОтветственногоПоОснованию(Источник,ОтветственныйТекущий)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Задачи.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗадачаСотрудника КАК Задачи
	|ГДЕ
	|	Задачи.Выполнена = ЛОЖЬ
	|	И Задачи.Ответственный = &Ответственный
	|	И Задачи.ПометкаУдаления = ЛОЖЬ
	|	И Задачи.Основание = &Основание";
	
	Запрос.УстановитьПараметр("Ответственный", ОтветственныйТекущий);
	Запрос.УстановитьПараметр("Основание", Источник.Ссылка);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

Функция ЕстьАктивныеСобытияОтветственногоПоОснованию(Источник,ОтветственныйТекущий)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Событие.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Событие КАК Событие
	|ГДЕ
	|	Событие.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияСобытий.Завершено)
	|	И Событие.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияСобытий.Отменено)
	|	И Событие.Ответственный = &Ответственный
	|	И Событие.ПометкаУдаления = ЛОЖЬ
	|	И Событие.ДокументОснование = &Основание";
	
	Запрос.УстановитьПараметр("Ответственный", ОтветственныйТекущий);
	Запрос.УстановитьПараметр("Основание", Источник.Ссылка);
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();
КонецФункции

#КонецОбласти
